# Springboard Data Science Career Track Unit 4 Challenge - Tier 3 Complete

## Objectives
Hey! Great job getting through those challenging DataCamp courses. You're learning a lot in a short span of time. 

In this notebook, you're going to apply the skills you've been learning, bridging the gap between the controlled environment of DataCamp and the *slightly* messier work that data scientists do with actual datasets!

Here’s the mystery we’re going to solve: ***which boroughs of London have seen the greatest increase in housing prices, on average, over the last two decades?***


A borough is just a fancy word for district. You may be familiar with the five boroughs of New York… well, there are 32 boroughs within Greater London [(here's some info for the curious)](https://en.wikipedia.org/wiki/London_boroughs). Some of them are more desirable areas to live in, and the data will reflect that with a greater rise in housing prices.

***This is the Tier 3 notebook, which means it's not filled in at all: we'll just give you the skeleton of a project, the brief and the data. It's up to you to play around with it and see what you can find out! Good luck! If you struggle, feel free to look at easier tiers for help; but try to dip in and out of them, as the more independent work you do, the better it is for your learning!***

This challenge will make use of only what you learned in the following DataCamp courses: 
- Prework courses (Introduction to Python for Data Science, Intermediate Python for Data Science)
- Data Types for Data Science
- Python Data Science Toolbox (Part One) 
- pandas Foundations
- Manipulating DataFrames with pandas
- Merging DataFrames with pandas

Of the tools, techniques and concepts in the above DataCamp courses, this challenge should require the application of the following: 
- **pandas**
    - **data ingestion and inspection** (pandas Foundations, Module One) 
    - **exploratory data analysis** (pandas Foundations, Module Two)
    - **tidying and cleaning** (Manipulating DataFrames with pandas, Module Three) 
    - **transforming DataFrames** (Manipulating DataFrames with pandas, Module One)
    - **subsetting DataFrames with lists** (Manipulating DataFrames with pandas, Module One) 
    - **filtering DataFrames** (Manipulating DataFrames with pandas, Module One) 
    - **grouping data** (Manipulating DataFrames with pandas, Module Four) 
    - **melting data** (Manipulating DataFrames with pandas, Module Three) 
    - **advanced indexing** (Manipulating DataFrames with pandas, Module Four) 
- **matplotlib** (Intermediate Python for Data Science, Module One)
- **fundamental data types** (Data Types for Data Science, Module One) 
- **dictionaries** (Intermediate Python for Data Science, Module Two)
- **handling dates and times** (Data Types for Data Science, Module Four)
- **function definition** (Python Data Science Toolbox - Part One, Module One)
- **default arguments, variable length, and scope** (Python Data Science Toolbox - Part One, Module Two) 
- **lambda functions and error handling** (Python Data Science Toolbox - Part One, Module Four)

## The Data Science Pipeline

This is Tier Three, so we'll get you started. But after that, it's all in your hands! When you feel done with your investigations, look back over what you've accomplished, and prepare a quick presentation of your findings for the next mentor meeting. 

Data Science is magical. In this case study, you'll get to apply some complex machine learning algorithms. But as  [David Spiegelhalter](https://www.youtube.com/watch?v=oUs1uvsz0Ok) reminds us, there is no substitute for simply **taking a really, really good look at the data.** Sometimes, this is all we need to answer our question.

Data Science projects generally adhere to the four stages of Data Science Pipeline:
1. Sourcing and loading 
2. Cleaning, transforming, and visualizing 
3. Modeling 
4. Evaluating and concluding

### 1. Sourcing and Loading 

Any Data Science project kicks off by importing  ***pandas***. The documentation of this wonderful library can be found [here](https://pandas.pydata.org/). As you've seen, pandas is conveniently connected to the [Numpy](http://www.numpy.org/) and [Matplotlib](https://matplotlib.org/) libraries. 

***Hint:*** This part of the data science pipeline will test those skills you acquired in the pandas Foundations course, Module One.

#### 1.1. Importing Libraries

In [1]:
#!pip install matplotlib

In [2]:
# Let's import the pandas, numpy libraries as pd, and np respectively. 

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import os
# Load the pyplot collection of functions from matplotlib, as plt

In [3]:
save_path = r"D:\IA\SpringBoad\DiegoRamos_Unit_4_Challenge_Tier_3"
os.chdir(save_path)

#### 1.2.  Loading the data
Your data comes from the [London Datastore](https://data.london.gov.uk/): a free, open-source data-sharing portal for London-oriented datasets.

In [4]:
# First, make a variable called url_LondonHousePrices, and assign it the following link, enclosed in quotation-marks as a string:
# https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls

url_LondonHousePrices = "https://data.london.gov.uk/download/uk-house-price-index/70ac0766-8902-4eb5-aab5-01951aaed773/UK%20House%20price%20index.xls"

# The dataset we're interested in contains the Average prices of the houses, and is actually on a particular sheet of the Excel file. 
# As a result, we need to specify the sheet name in the read_excel() method.
# Put this data into a variable called properties.  
properties = pd.read_excel(url_LondonHousePrices, sheet_name='Average price', index_col= 0)
properties

,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,Enfield,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,E09000010,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,79885.89069,72514.69096,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,80897.06551,73155.19746,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,81379.86288,72190.44144,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,82188.90498,71442.92235,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2024-07-01,754954,340826,590027,401848,529279,498796,866645,390595,544636,440726,...,220357,212790,246475,253237,339438,525373,378821,317278,NaN,304702
2024-08-01,750362,338083,596078,406623,545384,501619,859879,400992,552141,445600,...,224932,217597,249569,255449,344069,533030,385487,319006,NaN,309170
2024-09-01,719570,340295,592861,408441,544571,505545,836335,403679,552791,452183,...,224679,215409,248137,256820,341833,527535,382266,320030,NaN,308216
2024-10-01,692265,340932,589938,408837,553641,504982,809041,406601,542144,449243,...,225229,216134,249674,254938,342956,516521,380455,323483,NaN,307665
2024-11-01,670906,343528,592678,406441,545671,508954,815772,403054,541772,452341,...,226627,217939,248561,254912,339560,511279,377822,317608,NaN,306494

In [5]:
properties.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 360 entries, NaT to 2024-11-01
Data columns (total 48 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   City of London        360 non-null    object
 1   Barking & Dagenham    360 non-null    object
 2   Barnet                360 non-null    object
 3   Bexley                360 non-null    object
 4   Brent                 360 non-null    object
 5   Bromley               360 non-null    object
 6   Camden                360 non-null    object
 7   Croydon               360 non-null    object
 8   Ealing                360 non-null    object
 9   Enfield               360 non-null    object
 10  Greenwich             360 non-null    object
 11  Hackney               360 non-null    object
 12  Hammersmith & Fulham  360 non-null    object
 13  Haringey              360 non-null    object
 14  Harrow                360 non-null    object
 15  Havering              360 non-null    object
 16  Hillingdon            360 non-null    object
 17  Hounslow              360 non-null    object
 18  Islington             360 non-null    object
 19  Kensington & Chelsea  360 non-null    object
 20  Kingston upon Thames  360 non-null    object
 21  Lambeth               360 non-null    object
 22  Lewisham              360 non-null    object
 23  Merton                360 non-null    object
 24  Newham                360 non-null    object
 25  Redbridge             360 non-null    object
 26  Richmond upon Thames  360 non-null    object
 27  Southwark             360 non-null    object
 28  Sutton                360 non-null    object
 29  Tower Hamlets         360 non-null    object
 30  Waltham Forest        360 non-null    object
 31  Wandsworth            360 non-null    object
 32  Westminster           360 non-null    object
 33  Unnamed: 34           0 non-null      float64
 34  Inner London          360 non-null    object
 35  Outer London          360 non-null    object
 36  Unnamed: 37           0 non-null      float64
 37  NORTH EAST            360 non-null    object
 38  NORTH WEST            360 non-null    object
 39  YORKS & THE HUMBER    360 non-null    object
 40  EAST MIDLANDS         360 non-null    object
 41  WEST MIDLANDS         360 non-null    object
 42  EAST OF ENGLAND       360 non-null    object
 43  LONDON                360 non-null    object
 44  SOUTH EAST            360 non-null    object
 45  SOUTH WEST            360 non-null    object
 46  Unnamed: 47           0 non-null      float64
 47  England               360 non-null    object
dtypes: float64(3), object(45)
memory usage: 137.8+ KB

### 2. Cleaning, transforming, and visualizing
This second stage is arguably the most important part of any Data Science project. The first thing to do is take a proper look at the data. Cleaning forms the majority of this stage, and can be done both before or after Transformation.

The end goal of data cleaning is to have tidy data. When data is tidy: 

1. Each variable has a column.
2. Each observation forms a row.

Keep the end goal in mind as you move through this process, every step will take you closer. 



***Hint:*** This part of the data science pipeline should test those skills you acquired in: 
- Intermediate Python for data science, all modules.
- pandas Foundations, all modules. 
- Manipulating DataFrames with pandas, all modules.
- Data Types for Data Science, Module Four.
- Python Data Science Toolbox - Part One, all modules

**2.1. Exploring your data** 

Think about your pandas functions for checking out a dataframe.

In [6]:
properties.head()

,City of London,Barking & Dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,Enfield,...,NORTH WEST,YORKS & THE HUMBER,EAST MIDLANDS,WEST MIDLANDS,EAST OF ENGLAND,LONDON,SOUTH EAST,SOUTH WEST,Unnamed: 47,England
NaT,E09000001,E09000002,E09000003,E09000004,E09000005,E09000006,E09000007,E09000008,E09000009,E09000010,...,E12000002,E12000003,E12000004,E12000005,E12000006,E12000007,E12000008,E12000009,NaN,E92000001
1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,79885.89069,72514.69096,...,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,NaN,53202.77128
1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,80897.06551,73155.19746,...,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,NaN,53096.1549
1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,81379.86288,72190.44144,...,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,NaN,53201.2843
1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,82188.90498,71442.92235,...,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,NaN,53590.8548

**2.2. Cleaning the data**

You might find you need to transpose your dataframe, check out what its row indexes are, and reset the index. You  also might find you need to assign the values of the first row to your column headings  . (Hint: recall the .columns feature of DataFrames, as well as the iloc[] method).

Don't be afraid to use StackOverflow for help  with this.

In [7]:
# dataframe feature engineering

properties.drop(index=pd.NaT, inplace=True, errors='ignore')
properties.drop(columns=[col for col in properties.columns if col.startswith("Unnamed")], inplace=True)
properties.columns = properties.columns.str.lower().str.capitalize()
properties.reset_index(inplace = True)

**2.3. Cleaning the data (part 2)**

You might we have to **rename** a couple columns. How do you do this? The clue's pretty bold...

In [8]:
# rename column and date time format

properties.rename(columns = {'index':'Date'}, inplace = True)
properties['Date'] = pd.to_datetime(properties['Date'], format = '%Y-%m-%d').dt.date


properties.head()

,Date,City of london,Barking & dagenham,Barnet,Bexley,Brent,Bromley,Camden,Croydon,Ealing,...,North east,North west,Yorks & the humber,East midlands,West midlands,East of england,London,South east,South west,England
0,1995-01-01,91448.98487,50460.2266,93284.51832,64958.09036,71306.56698,81671.47692,120932.8881,69158.16225,79885.89069,...,42076.35411,43958.48001,44803.42878,45544.52227,48527.52339,56701.5961,74435.76052,64018.87894,54705.1579,53202.77128
1,1995-02-01,82202.77314,51085.77983,93190.16963,64787.92069,72022.26197,81657.55944,119508.8622,68951.09542,80897.06551,...,42571.98949,43925.42289,44528.80721,46051.57066,49341.29029,56593.59475,72777.93709,63715.02399,54356.14843,53096.1549
2,1995-03-01,79120.70256,51268.96956,92247.52435,64367.49344,72015.76274,81449.31143,120282.2131,68712.44341,81379.86288,...,42369.72984,44434.8681,45200.46775,45383.82395,49442.17973,56171.18278,73896.84204,64113.60858,53583.07667,53201.2843
3,1995-04-01,77101.20804,53133.50526,90762.87492,64277.66881,72965.63094,81124.41227,120097.899,68610.04641,82188.90498,...,42095.8436,44267.7796,45614.34341,46124.23045,49455.93299,56567.89582,74455.28754,64623.22395,54786.01938,53590.8548
4,1995-05-01,84409.14932,53042.24852,90258.00033,63997.13588,73704.04743,81542.61561,119929.2782,68844.9169,82077.05525,...,43266.45165,44223.61973,44830.98563,45878.00396,50369.66188,56479.80183,75432.02786,64530.36358,54698.83831,53678.24041

**2.4.Transforming the data**

Remember what Wes McKinney said about tidy data? 

You might need to **melt** your DataFrame here.

In [9]:
#Transpose data

properties = np.transpose(properties)

properties.head()

,0,1,2,3,4,5,6,7,8,9,...,349,350,351,352,353,354,355,356,357,358
Date,1995-01-01,1995-02-01,1995-03-01,1995-04-01,1995-05-01,1995-06-01,1995-07-01,1995-08-01,1995-09-01,1995-10-01,...,2024-02-01,2024-03-01,2024-04-01,2024-05-01,2024-06-01,2024-07-01,2024-08-01,2024-09-01,2024-10-01,2024-11-01
City of london,91448.98487,82202.77314,79120.70256,77101.20804,84409.14932,94900.51244,110128.0423,112329.4376,104473.1096,108038.1181,...,840075,831249,810250,813219,808227,754954,750362,719570,692265,670906
Barking & dagenham,50460.2266,51085.77983,51268.96956,53133.50526,53042.24852,53700.34831,52113.12157,52232.19868,51471.61353,51513.7576,...,328266,333303,335559,335794,332826,340826,338083,340295,340932,343528
Barnet,93284.51832,93190.16963,92247.52435,90762.87492,90258.00033,90107.23471,91441.24768,92361.31512,93273.12245,92567.38498,...,563115,569976,573051,580130,584621,590027,596078,592861,589938,592678
Bexley,64958.09036,64787.92069,64367.49344,64277.66881,63997.13588,64252.32335,63722.70055,64432.60005,64509.54767,64529.93725,...,394741,395633,396584,396070,400617,401848,406623,408441,408837,406441

Remember to make sure your column data types are all correct. Average prices, for example, should be floating point numbers...

In [10]:
# prices formating to decimal float
properties.iloc[1:] = properties.iloc[1:].apply(pd.to_numeric, errors='coerce').round(3)
properties.style.format(precision=2)

properties.head()

,0,1,2,3,4,5,6,7,8,9,...,349,350,351,352,353,354,355,356,357,358
Date,1995-01-01,1995-02-01,1995-03-01,1995-04-01,1995-05-01,1995-06-01,1995-07-01,1995-08-01,1995-09-01,1995-10-01,...,2024-02-01,2024-03-01,2024-04-01,2024-05-01,2024-06-01,2024-07-01,2024-08-01,2024-09-01,2024-10-01,2024-11-01
City of london,91448.985,82202.773,79120.703,77101.208,84409.149,94900.512,110128.042,112329.438,104473.11,108038.118,...,840075.0,831249.0,810250.0,813219.0,808227.0,754954.0,750362.0,719570.0,692265.0,670906.0
Barking & dagenham,50460.227,51085.78,51268.97,53133.505,53042.249,53700.348,52113.122,52232.199,51471.614,51513.758,...,328266.0,333303.0,335559.0,335794.0,332826.0,340826.0,338083.0,340295.0,340932.0,343528.0
Barnet,93284.518,93190.17,92247.524,90762.875,90258.0,90107.235,91441.248,92361.315,93273.122,92567.385,...,563115.0,569976.0,573051.0,580130.0,584621.0,590027.0,596078.0,592861.0,589938.0,592678.0
Bexley,64958.09,64787.921,64367.493,64277.669,63997.136,64252.323,63722.701,64432.6,64509.548,64529.937,...,394741.0,395633.0,396584.0,396070.0,400617.0,401848.0,406623.0,408441.0,408837.0,406441.0

**2.5. Cleaning the data (part 3)**

Do we have an equal number of observations in the ID, Average Price, Month, and London Borough columns? Remember that there are only 32 London Boroughs. How many entries do you have in that column? 

Check out the contents of the London Borough column, and if you find null values, get rid of them however you see fit.

In [11]:
# drop Null values 
properties.dropna(inplace = True)
properties.isnull().sum()

0      0
1      0
2      0
3      0
4      0
      ..
354    0
355    0
356    0
357    0
358    0
Length: 359, dtype: int64

**2.6. Visualizing the data**

To visualize the data, why not subset on a particular London Borough? Maybe do a line plot of Month against Average Price?

In [12]:
properties.index

Index(['Date', 'City of london', 'Barking & dagenham', 'Barnet', 'Bexley',
       'Brent', 'Bromley', 'Camden', 'Croydon', 'Ealing', 'Enfield',
       'Greenwich', 'Hackney', 'Hammersmith & fulham', 'Haringey', 'Harrow',
       'Havering', 'Hillingdon', 'Hounslow', 'Islington',
       'Kensington & chelsea', 'Kingston upon thames', 'Lambeth', 'Lewisham',
       'Merton', 'Newham', 'Redbridge', 'Richmond upon thames', 'Southwark',
       'Sutton', 'Tower hamlets', 'Waltham forest', 'Wandsworth',
       'Westminster', 'Inner london', 'Outer london', 'North east',
       'North west', 'Yorks & the humber', 'East midlands', 'West midlands',
       'East of england', 'London', 'South east', 'South west', 'England'],
      dtype='object')

In [13]:
import matplotlib.pyplot as plt

# plot borought.  
borough_name = "Brent"
london_borough = properties.loc[borough_name] 

properties.columns = properties.columns.year 
properties_yearly = properties.groupby(properties.columns, axis=1).mean()

plt.figure(figsize=(12, 6)) 
plt.plot(london_borough, linestyle='-', label=borough_name, color='r', linewidth=1)


plt.xlabel("Month")
plt.ylabel("Average Price (£)")
plt.title(f"Average House Price in {borough_name} Over Time")
plt.legend()
plt.grid(True)


plt.show()

AttributeError: 'RangeIndex' object has no attribute 'year'

To limit the number of data points you have, you might want to extract the year from every month value your *Month* column. 

To this end, you *could* apply a ***lambda function***. Your logic could work as follows:
1. look through the `Month` column
2. extract the year from each individual value in that column 
3. store that corresponding year as separate column. 

Whether you go ahead with this is up to you. Just so long as you answer our initial brief: which boroughs of London have seen the greatest house price increase, on average, over the past two decades?

**3. Modeling**

Consider creating a function that will calculate a ratio of house prices, comparing the price of a house in 2018 to the price in 1998.

Consider calling this function create_price_ratio.

You'd want this function to:
1. Take a filter of dfg, specifically where this filter constrains the London_Borough, as an argument. For example, one admissible argument should be: dfg[dfg['London_Borough']=='Camden'].
2. Get the Average Price for that Borough, for the years 1998 and 2018.
4. Calculate the ratio of the Average Price for 1998 divided by the Average Price for 2018.
5. Return that ratio.

Once you've written this function, you ultimately want to use it to iterate through all the unique London_Boroughs and work out the ratio capturing the difference of house prices between 1998 and 2018.

Bear in mind: you don't have to write a function like this if you don't want to. If you can solve the brief otherwise, then great! 

***Hint***: This section should test the skills you acquired in:
- Python Data Science Toolbox - Part One, all modules

### 4. Conclusion
What can you conclude? Type out your conclusion below. 

Look back at your notebook. Think about how you might summarize what you have done, and prepare a quick presentation on it to your mentor at your next meeting. 

We hope you enjoyed this practical project. It should have consolidated your data hygiene and pandas skills by looking at a real-world problem involving just the kind of dataset you might encounter as a budding data scientist. Congratulations, and looking forward to seeing you at the next step in the course!